code_names = [
['01','01-bs', '調剤事業部'],
['1399','1399','茨木物流'],
['1460','1460','ｱﾋﾟｽﾗｲﾌｹｱ本部'],
['1461','1461','梅田本社'],
['1462','1462','訪問介護太田'],
['1463','1463','訪問介護あい'],
['1464','1464','訪問介護狭山'],
['1465','1465','ｹｱﾌﾟﾗﾝ茨木中央'],
['1466','1466','ｹｱﾌﾟﾗﾝあい'],
['1470','1470','ﾗｲﾌｻﾎﾟｰﾄ本部'],
['1471','1471','ゆうとぴ庵摂津・千里丘'],
['1472','1472','ゆうとぴ庵神戸・石屋川'],
['1473','1473','ゆうとぴ庵大阪・淡路'],
['1474','1474','ゆうとぴ庵西神戸'],
['2110','2110','未定'],
['2111','2111','未定'],
['2112','2112','未定'],
['2113','2113','未定'],
['2279','2279','B福山東'],
['2280','2280','ﾊﾞﾝﾊﾞﾝ'],
['4006','4006','KIRARI Phamacy'],
['9571','9571','旧中川店'],
['91227','91227','一桝/大館物流センター'],
# ['1040683','1040683','別府北浜店'],
# ['1040684','1040684','福山御門店'],
# ['1040685','1040685','海南築地店'],
# ['1040686','1040686','海南下津店'],
# ['1040688','1040688','御器所店'],
# ['1040689','1040689','マザーパレス大館'],
# ['3010000','3010000','小売本部'],
]

code_names.each do |code, store_code, name|
  begin
    dept = Department.find_by_code(code)
    if dept.nil?
      Department.create!(code: code, name: name, store_code: store_code, store_name: name, hidden: true)
      puts "created #{code} #{name}"
    else
      puts "exists #{code} #{name}"
    end
  rescue => e
    puts "error #{code} #{name} #{e.message}"
  end
end